barawn/osu-boards/samd/boards.txt
radiant_v1.name=RADIANTv1
radiant_v1.vid=0x239a
radiant_v1.pid=0x0015
radiant_v1.upload.tool=arduino:bossac
radiant_v1.upload.protocol=sam-ba
radiant_v1.upload.maximum_size=253952
radiant_v1.build.mcu=cortex-m0plus
radiant_v1.build.f_cpu=48000000L
radiant_v1.build.usb_product="RADIANTv1"
radiant_v1.build.usb_manufacturer="OSU"
radiant_v1.build.board=SAMD_ZERO
radiant_v1.build.core=arduino:arduino
radiant_v1.build.extra_flags=-DCRYSTALLESS -D__SAMD21J18A__ {build.usb_flags}
radiant_v1.build.variant=radiant_v1
radiant_v1.build.variant_system_lib=
radiant_v1.build.vid=0x2341
radiant_v1.build.pid=0x804d
radiant_v1.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld

radiant_v2.name=RADIANTv2
radiant_v2.vid=0x239a
radiant_v2.pid=0x0015
radiant_v2.upload.tool=arduino:bossac
radiant_v2.upload.protocol=sam-ba
radiant_v2.upload.maximum_size=253952
radiant_v2.upload.use_1200bps_touch=true
radiant_v2.upload.wait_for_upload_port=true
radiant_v2.upload.native_usb=true
radiant_v2.build.mcu=cortex-m0plus
radiant_v2.build.f_cpu=48000000L
radiant_v2.build.usb_product="RADIANTv2"
radiant_v2.build.usb_manufacturer="OSU"
radiant_v2.build.board=SAMD_ZERO
radiant_v2.build.core=arduino:arduino
radiant_v2.build.extra_flags=-DCRYSTALLESS -D__SAMD21J18A__ {build.usb_flags}
radiant_v2.build.variant=radiant_v2
radiant_v2.build.variant_system_lib=
radiant_v2.build.vid=0x2341
radiant_v2.build.pid=0x804d
radiant_v2.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
